<picture><img height="50" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/header.svg" /></picture> 




<div align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;1&nbsp;Medium</div><br>

<table>

<thead>

<tr>

<th align="left" scope="col">Risk ID</th>

<th align="left" scope="col">Severity</th>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">Folder/s</th>

<th align="left" scope="col">Summary</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

<td>I02-NI-GCP</td>

<td align="center"><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture></td>

<td align="center"><sub><picture><img width="24" height="24" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/gcp.svg" /></picture></sub></td>

<td>external-firewall</td>

<td>TCP on all ports can enter your network from Private IPs</td>

</tr>
                 
</tbody>
</table>

**Detailed Risks Report**
---
<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>influxdb-enterprise</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'init': [31m[0mThere are some problems with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mInvalid default value for variable[0m
[31m│[0m [0m
[31m│[0m [0m[0m  on ../../modules/service-account-firewall-rules/variables.tf line 33, in variable "source_service_accounts":
[31m│[0m [0m  33:   default = [4m"netwaaaork"[0m[0m
[31m│[0m [0m
[31m│[0m [0mThis default value is not compatible with the variable's type constraint:
[31m│[0m [0mlist of string required.
[31m╵[0m[0m
[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mInvalid default value for variable[0m
[31m│[0m [0m
[31m│[0m [0m[0m  on ../../modules/service-account-firewall-rules/variables.tf line 39, in variable "target_service_accounts":
[31m│[0m [0m  39:   default = [4m"bbbbb"[0m[0m
[31m│[0m [0m
[31m│[0m [0mThis default value is not compatible with the variable's type constraint:
[31m│[0m [0mlist of string required.
[31m╵[0m[0m
[0m[0m
: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->


</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>influxdb-oss</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'init': [31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mFailed to query available provider packages[0m
[31m│[0m [0m
[31m│[0m [0m[0mCould not retrieve the list of available versions for provider
[31m│[0m [0mhashicorp/google2: provider registry registry.terraform.io does not have a
[31m│[0m [0mprovider named registry.terraform.io/hashicorp/google2
[31m│[0m [0m
[31m│[0m [0mAll modules should specify their required_providers so that external
[31m│[0m [0mconsumers will get the correct providers when using a module. To see which
[31m│[0m [0mmodules are currently depending on hashicorp/google2, run the following
[31m│[0m [0mcommand:
[31m│[0m [0m    terraform providers
[31m╵[0m[0m
[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mFailed to query available provider packages[0m
[31m│[0m [0m
[31m│[0m [0m[0mCould not retrieve the list of available versions for provider
[31m│[0m [0mhashicorp/google: no available releases match the given constraints ~>
[31m│[0m [0m2.7.0, 4.5.0
[31m╵[0m[0m
[0m[0m
: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->


</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>tick-enterprise-standalone</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'init': [31m[0mThere are some problems with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mInvalid default value for variable[0m
[31m│[0m [0m
[31m│[0m [0m[0m  on ../../modules/service-account-firewall-rules/variables.tf line 33, in variable "source_service_accounts":
[31m│[0m [0m  33:   default = [4m"netwaaaork"[0m[0m
[31m│[0m [0m
[31m│[0m [0mThis default value is not compatible with the variable's type constraint:
[31m│[0m [0mlist of string required.
[31m╵[0m[0m
[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mInvalid default value for variable[0m
[31m│[0m [0m
[31m│[0m [0m[0m  on ../../modules/service-account-firewall-rules/variables.tf line 39, in variable "target_service_accounts":
[31m│[0m [0m  39:   default = [4m"bbbbb"[0m[0m
[31m│[0m [0m
[31m│[0m [0mThis default value is not compatible with the variable's type constraint:
[31m│[0m [0mlist of string required.
[31m╵[0m[0m
[0m[0m
: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->


</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>terraform</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'init': [31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mFailed to query available provider packages[0m
[31m│[0m [0m
[31m│[0m [0m[0mCould not retrieve the list of available versions for provider
[31m│[0m [0mhashicorp/google: no available releases match the given constraints ~>
[31m│[0m [0m2.7.0, 4.5.0
[31m╵[0m[0m
[0m[0m
: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->


</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/warning.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>external-firewall</b></h3><div  align="right">&nbsp;&nbsp;&nbsp;&nbsp;&nbsp;<picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>&nbsp;1&nbsp;Medium</div></summary>
<details>

<summary><picture><img width="10" height="10" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/medium.svg" /></picture>  I02-NI-GCP</summary> 

### **Title:**
TCP on all ports can enter your network from Private IPs

### **Description:**
Allowing TCP on all ports to enter your network is extremely riskysince this includes many vulnerable services. This is risky even if the traffic is only allowed from business partners or through VPNs: a remote laptop connecting through a VPN could easily infect your network with a worm or virus.

### **Recommendation:**
Review all the rules that allow inbound traffic with TCP on all ports, and limit them to those services you actually require.  

### **Details:**
<table>
<thead>

<tr>

<th align="left" scope="col">Vendor</th>

<th align="left" scope="col">From Port</th>

<th align="left" scope="col">To Port</th>

<th align="left" scope="col">Ip Protocol</th>

<th align="left" scope="col">Ip Range</th>

</tr>

</thead>

<tbody id="tableBody">

<tr>

  <td>GCP</td>

  <td>443</td>

  <td>443</td>

  <td>tcp</td>

  <td>10.0.0.0/32</td>

  </tr>
                
</tbody>
</table>

</details>



<details>
<summary>Terraform Log</summary>
<br>Output

```


Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create

Terraform will perform the following actions:

  # google_compute_firewall.external will be created
  + resource "google_compute_firewall" "external" {
      + creation_timestamp = (known after apply)
      + destination_ranges = (known after apply)
      + direction          = (known after apply)
      + enable_logging     = (known after apply)
      + id                 = (known after apply)
      + name               = "test-fw-ext"
      + network            = "network"
      + priority           = 1000
      + project            = "cloudflow-qa-gcp1"
      + self_link          = (known after apply)
      + source_ranges      = [
          + "10.0.0.0/32",
        ]
      + target_tags        = [
          + "hello",
        ]

      + allow {
          + ports    = [
              + "443",
            ]
          + protocol = "tcp"
        }
    }

Plan: 1 to add, 0 to change, 0 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: /home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/terraform/modules/external-firewall\tmp\external-firewall.out

To perform exactly these actions, run the following command to apply:
    terraform apply "/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/terraform/modules/external-firewall\\tmp\\external-firewall.out"


```
<br>

</details> <!-- End Format Logs -->

</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>service-account-firewall-rules</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'init': [31m[0mThere are some problems with the configuration, described below.

The Terraform configuration must be valid before initialization so that
Terraform can determine which modules and providers need to be installed.[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mInvalid default value for variable[0m
[31m│[0m [0m
[31m│[0m [0m[0m  on variables.tf line 33, in variable "source_service_accounts":
[31m│[0m [0m  33:   default = [4m"netwaaaork"[0m[0m
[31m│[0m [0m
[31m│[0m [0mThis default value is not compatible with the variable's type constraint:
[31m│[0m [0mlist of string required.
[31m╵[0m[0m
[0m[0m
[31m[31m╷[0m[0m
[31m│[0m [0m[1m[31mError: [0m[0m[1mInvalid default value for variable[0m
[31m│[0m [0m
[31m│[0m [0m[0m  on variables.tf line 39, in variable "target_service_accounts":
[31m│[0m [0m  39:   default = [4m"bbbbb"[0m[0m
[31m│[0m [0m
[31m│[0m [0mThis default value is not compatible with the variable's type constraint:
[31m│[0m [0mlist of string required.
[31m╵[0m[0m
[0m[0m
: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->


</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>tick-instance-group</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'validate -no-color': 
Error: Insufficient version blocks

  on main.tf line 10, in resource "google_compute_region_instance_group_manager" "default":
  10: resource "google_compute_region_instance_group_manager" "default" {

At least 1 "version" blocks are required.

Error: Unsupported argument

  on main.tf line 14, in resource "google_compute_region_instance_group_manager" "default":
  14:   instance_template  = google_compute_instance_template.default.self_link

An argument named "instance_template" is not expected here.
: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->


</details>

---

<details>
<summary><sub><sub><sub><picture><img height="20" width="20" src="https://raw.githubusercontent.com/algosec/risk-analysis-action/develop/icons/failure.svg" /></picture></sub></sub></sub>&nbsp;&nbsp;<h3><b>tick-service-account</b></h3></summary>

<details>
<summary>Terraform Log</summary>

<br>Errors

```

Command 'terraform' failed with args 'plan -input=false -no-color -out=/home/runner/work/ForTraining/ForTraining_ALGOSEC_CODE_ANALYSIS/terraform/modules/tick-service-account\tmp\tick-service-account.out': 
Error: No value for required variable

  on variables.tf line 6:
   6: variable "project" {

The root module input variable "project" is not set, and has no default
value. Use a -var or -var-file command line argument to provide a value for
this variable.

Error: No value for required variable

  on variables.tf line 11:
  11: variable "name" {

The root module input variable "name" is not set, and has no default value.
Use a -var or -var-file command line argument to provide a value for this
variable.

Error: No value for required variable

  on variables.tf line 16:
  16: variable "display_name" {

The root module input variable "display_name" is not set, and has no default
value. Use a -var or -var-file command line argument to provide a value for
this variable.
: Error: The process '/usr/local/bin/terraform' failed with exit code 1

```
<br>
</details> <!-- End Format Logs -->


</details>

---


<br>
Pusher: @Artsemil<br>
Action: pull_request<br>
Workflow: Test Repo CI/CD